# 1. List Comprehension을 사용해서 1~100 까지의 숫자 출력하기

num = list([i for i in range(1, 101)])
print(num)
'''
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 
40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 
59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 
78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 
97, 98, 99, 100]
'''
print(type(num))    # <class 'list'>
print(len(num)) # 100

# 2. List Comprehension을 사용해서 1~100 까지의 숫자 중 3으로 나누어 떨어지는 수만 출력하기
num = list([i for i in range(1, 101) if i % 3 == 0])
print(num)
'''
[3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 
63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99]
'''
print(type(num))    # <class 'list'>
print(len(num)) # 33

# 3. List Comprehension을 사용해서 1~100 까지의 숫자 중 3 또는 7 나누어 떨어지는 수만 출력하기
num = list([i for i in range(1,100) if i % 3 == 0 and i % 7 == 0])

print(num)  # [21, 42, 63, 84]
print(type(num))    # <class 'list'>
print(len(num)) # 4