# 최소자승문제
# Least Square
import numpy as np

A = np.array([[1,1,0],[0,1,1],[1,1,1],[1,1,2]])
print(A)
'''
[[1 1 0]
 [0 1 1]
 [1 1 1]
 [1 1 2]]
'''
b = np.array([[2],[2],[3],[4.1]])
print(b)
'''
[[2. ]
 [2. ]
 [3. ]
 [4.1]]
'''

# 1번째 방법
Apinv = np.linalg.inv(A.T @ A) @ A.T
print(Apinv)
'''
[[ 0.33333333 -1.          0.33333333  0.33333333]
 [ 0.5         1.          0.         -0.5       ]
 [-0.5         0.          0.          0.5       ]]
'''

x = Apinv @ b
print(x)
'''
[[1.03333333]
 [0.95      ]
 [1.05      ]]
'''
print(A @ x)
'''
[[1.98333333]
 [2.        ]
 [3.03333333]
 [4.08333333]]
'''

# lstsq() 함수 사용
x, resid, rank, s = np.linalg.lstsq(A,b)
print(x)
'''
[[1.03333333]
 [0.95      ]
 [1.05      ]]
'''
print(resid)    # 잔차 제곱합 --> [0.00166667]

# 직접구한 잔차 제곱합
print(np.linalg.norm(A @ x - b) ** 2)   # 0.0016666666666666624

